var km = new Vue({
	el: '#gonggao',
	data: {
		date_lisrt: ""
	},
	methods: {

	},
	mounted() {
		var th = this,
		      self={}
        self.chanshu=1
			if(self.chanshu == 1) { //平台公共 2站内信
				th.date_lisrt = [{
						id: 0,
						name: "官网系统升级",
						time: "2017/11/09" 
					},
					{
						id: 1,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 2,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 3,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 4,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 5,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 6,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 7,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 8,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 9,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 10,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 11,
						name: "官网系统升级",
						time: "2017/11/09"
					},
					{
						id: 12,
						name: "官网系统升级",
						time: "2017/11/09"
					}
				]
			} else {
				th.date_lisrt = [{
						id: 0,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 1,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 2,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 3,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 4,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 5,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 6,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 7,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 8,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 9,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 10,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 11,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					},
					{
						id: 12,
						name: "恭喜您，您的优惠单已完成（金额RMB：4.62，优惠名称：电子返水，请您注意查收）如有疑问请联系在线客服咨询。",
						time: "2017/11/09"
					}
				]
			}


	}
})

mui.init({
	pullRefresh: {
		container: '#pullrefresh',
		up: {
			contentrefresh: '正在加载...',
			callback: pullupRefresh
		}
	}
});

function pullupRefresh() {
	var da_sde = km.date_lisrt[0]
	for(var i = 0; i < 10; i++) {
		km.date_lisrt.push(da_sde)
	}
	this.endPullupToRefresh(false)
}